# semver-regex-range
Lets you match semver ranges using regex.

Test it out here: https://tian000.github.io/semver-regex-range/

### Usage
This library is able to generate greater than ranges (>=) and bounded ranges (v1 < x <= v2).
```node
> import { toSemverRange } from './index'
undefined
> toSemverRange({ major: 0, minor: 0, patch: 0 })
'(0\\.0\\.0(\\.0)*)|(0\\.0\\.([1-9]|[1-9][0-9]{1,})(\\.(0|[1-9][0-9]*))*)|(0\\.([1-9]|[1-9][0-9]{1,})(\\.(0|[1-9][0-9]*))+)|(([1-9]|[1-9][0-9]{1,})\\.(0|[1-9][0-9]*)(\\.(0|[1-9][0-9]*))+)'
> toSemverRange({ major: 0, minor: 0, patch: 5 })
'(0\\.0\\.5(\\.0)*)|(0\\.0\\.([6-9]|[1-9][0-9]{1,})(\\.(0|[1-9][0-9]*))*)|(0\\.([1-9]|[1-9][0-9]{1,})(\\.(0|[1-9][0-9]*))+)|(([1-9]|[1-9][0-9]{1,})\\.(0|[1-9][0-9]*)(\\.(0|[1-9][0-9]*))+)'
> toSemverRange({ major: 23, minor: 19, patch: 0 })
'(23\\.19\\.0(\\.0)*)|(23\\.19\\.([1-9]|[1-9][0-9]{1,})(\\.(0|[1-9][0-9]*))*)|(23\\.(2[0-9]|[3-9][0-9]|[1-9][0-9]{2,})(\\.(0|[1-9][0-9]*))+)|((2[4-9]|[3-9][0-9]|[1-9][0-9]{2,})\\.(0|[1-9][0-9]*)(\\.(0|[1-9][0-9]*))+)'
> toSemverRange({ major: 0, minor: 0, patch: 5 }, { major: 0, minor: 0, patch: 8 })
'(?=((0\\.0\\.5(\\.0)*)|(0\\.0\\.([6-9]|[1-9][0-9]{1,})(\\.(0|[1-9][0-9]*))*)|(0\\.([1-9]|[1-9][0-9]{1,})(\\.(0|[1-9][0-9]*))+)|(([1-9]|[1-9][0-9]{1,})\\.(0|[1-9][0-9]*)(\\.(0|[1-9][0-9]*))+)))((?!((0\\.0\\.8(\\.0)*)|(0\\.0\\.(9|[1-9][0-9]{1,})(\\.(0|[1-9][0-9]*))*)|(0\\.([1-9]|[1-9][0-9]{1,})(\\.(0|[1-9][0-9]*))+)|(([1-9]|[1-9][0-9]{1,})\\.(0|[1-9][0-9]*)(\\.(0|[1-9][0-9]*))+)))((0|[1-9][0-9]*)\\.(0|[1-9][0-9]*)(\\.(0|[1-9][0-9]*))+))'
```

### PRs are welcome.